In [30]:
import pandas as pd
import numpy as np

In [31]:
rng = np.random.RandomState(42)

In [41]:

df = pd.DataFrame(A, columnarea = pd.Series({'California': 423967, 'Texas': 695662,'New York': 141297, 'Florida': 170312,'Illinois': 149995})

SyntaxError: unexpected EOF while parsing (<ipython-input-41-f05ee2dff13c>, line 1)

In [46]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})

pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})

data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [47]:
data.values

array([[  423967, 38332521],
       [  695662, 26448193],
       [  141297, 19651127],
       [  170312, 19552860],
       [  149995, 12882135]], dtype=int64)

In [48]:
data.T

      California     Texas  New York   Florida  Illinois
area      423967    695662    141297    170312    149995
pop     38332521  26448193  19651127  19552860  12882135

In [69]:
B = pd.DataFrame(rng.randint(0, 10, (4, 3)),
columns=list('BAC'))
B

   B  A  C
0  8  6  1
1  3  8  1
2  9  8  9
3  4  1  3

In [70]:
list('BAC')

['B', 'A', 'C']

In [75]:
B.stack()

0  B    8
   A    6
   C    1
1  B    3
   A    8
   C    1
2  B    9
   A    8
   C    9
3  B    4
   A    1
   C    3
dtype: int32

In [83]:
df = pd.DataFrame([[1, np.nan, 2,8],
[2, 3, 5,np.nan],
[np.nan, 4, 6,9]])
df

     0    1  2    3
0  1.0  NaN  2  8.0
1  2.0  3.0  5  NaN
2  NaN  4.0  6  9.0

In [84]:
df.dropna(axis=1,how='all')

     0    1  2    3
0  1.0  NaN  2  8.0
1  2.0  3.0  5  NaN
2  NaN  4.0  6  9.0

In [85]:
df.dropna(axis=0,thresh=3)

     0    1  2    3
0  1.0  NaN  2  8.0
1  2.0  3.0  5  NaN
2  NaN  4.0  6  9.0

In [86]:
df

     0    1  2    3
0  1.0  NaN  2  8.0
1  2.0  3.0  5  NaN
2  NaN  4.0  6  9.0

In [89]:
df.fillna(method = 'ffill', axis =1)

     0    1    2    3
0  1.0  1.0  2.0  8.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  9.0

In [90]:
df.fillna(method = 'bfill', axis =1)

     0    1    2    3
0  1.0  2.0  2.0  8.0
1  2.0  3.0  5.0  NaN
2  4.0  4.0  6.0  9.0

In [93]:
pop[[i for i in pop.index if i[1] == 2010]]

TypeError: 'int' object is not subscriptable